support-workers/src/typescript/test/fixtures/createSalesforceContact/contributionMonthlyUSD.json

{
  "requestId": "a81f0dee-1aa5-efbf-0000-00000001315e",
  "user": {
    "id": "111547283",
    "primaryEmailAddress": "test@test.com",
    "title": null,
    "firstName": "Test",
    "lastName": "User",
    "billingAddress": {
      "lineOne": null,
      "lineTwo": null,
      "city": null,
      "state": "NJ",
      "postCode": "07071",
      "country": "US"
    },
    "deliveryAddress": null,
    "telephoneNumber": null,
    "isTestUser": false,
    "deliveryInstructions": null
  },
  "giftRecipient": null,
  "product": {
    "amount": 5,
    "currency": "USD",
    "billingPeriod": "Monthly",
    "productType": "Contribution"
  },
  "analyticsInfo": {
    "isGiftPurchase": false,
    "paymentProvider": "Stripe"
  },
  "paymentMethod": {
    "PaymentType": "Stripe",
    "TokenId": "pm_0Q7yviItVxyc3Q6nDITUEtgP",
    "SecondTokenId": "cus_QzytGiNA2Wu2NF",
    "CreditCardNumber": "2994",
    "CreditCardCountry": "US",
    "CreditCardExpirationMonth": 7,
    "CreditCardExpirationYear": 2027,
    "CreditCardType": "MasterCard",
    "PaymentGateway": "Stripe PaymentIntents GNM Membership",
    "Type": "CreditCardReferenceTransaction",
    "StripePaymentType": "StripePaymentRequestButton"
  },
  "firstDeliveryDate": null,
  "appliedPromotion": null,
  "csrUsername": null,
  "salesforceCaseId": null,
  "acquisitionData": {
    "ophanIds": {
      "pageviewId": "m21ub09l49t18qzefhtf",
      "browserId": "ZiM1rHHJROZSZUNACvFv_sPw"
    },
    "referrerAcquisitionData": {
      "campaignCode": null,
      "referrerPageviewId": "",
      "referrerUrl": "https://www.theguardian.com/us-news/2024/oct/08/salmonella-egg-recall-fda",
      "componentId": "AMP__2024_07_18_AMP_BETSY__US__V1_RECURRING",
      "componentType": "ACQUISITIONS_EPIC",
      "source": "GOOGLE_AMP",
      "abTests": [
        {
          "name": "2024_07_18_AMP_BETSY__US",
          "variant": "V1_RECURRING"
        }
      ],
      "queryParameters": [
        {
          "name": "selected-contribution-type",
          "value": "MONTHLY"
        },
        {
          "name": "selected-amount",
          "value": "5"
        }
      ],
      "hostname": "support.theguardian.com",
      "gaClientId": null,
      "userAgent": "Mozilla/5.0 (Linux; Android 10; K) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/129.0.0.0 Mobile Safari/537.36",
      "ipAddress": "10.248.135.181",
      "labels": [
        "generic-checkout"
      ]
    },
    "supportAbTests": [
      {
        "name": "abandonedBasket",
        "variant": "control"
      },
      {
        "name": "auPartnerBenefit",
        "variant": "variant"
      }
    ]
  }
}
